In [12]:
import os
import numpy as np 
import pandas as pd
from joblib import dump, load
from sklearn import preprocessing

In [13]:
articles = pd.read_csv("h-and-m-personalized-fashion-recommendations/articles.csv")
customers = pd.read_csv("h-and-m-personalized-fashion-recommendations/customers.csv")
transactions = pd.read_csv("h-and-m-personalized-fashion-recommendations/transactions_train.csv",)

In [14]:

le_articles = preprocessing.LabelEncoder()
le_customers = preprocessing.LabelEncoder()
le_articles.fit(articles.article_id.unique())
le_customers.fit(customers.customer_id.unique())

LabelEncoder()

In [15]:
transactions['customer_id'] = le_customers.transform(transactions['customer_id'])
transactions['article_id'] = le_articles.transform(transactions['article_id'])

customers['customer_id'] = le_customers.transform(customers['customer_id'])
articles['article_id'] = le_articles.transform(articles['article_id'])

In [17]:
print(transactions.article_id.min())
print(transactions.article_id.max())
print(transactions.customer_id.min())
print(transactions.customer_id.max())

0
105539
0
1371979

In [18]:
transactions['article_id'] = transactions['article_id'].astype(np.int32)
transactions['customer_id'] = transactions['customer_id'].astype(np.int32)
transactions['sales_channel_id'] = transactions['sales_channel_id'].astype('int8')
transactions['price'] = transactions['price'].astype('float32')

In [19]:
transactions.head()

        t_dat  customer_id  article_id     price  sales_channel_id
0  2018-09-20            2       40179  0.050831                 2
1  2018-09-20            2       10520  0.030492                 2
2  2018-09-20            7        6387  0.015237                 2
3  2018-09-20            7       46304  0.016932                 2
4  2018-09-20            7       46305  0.016932                 2

In [20]:
transactions.dtypes

t_dat                object
customer_id           int32
article_id            int32
price               float32
sales_channel_id       int8
dtype: object

In [21]:
folder = './h-and-m-personalized-fashion-recommendations/'

dump(le_articles, os.path.join(folder, 'le_articles.joblib'))
dump(le_customers, os.path.join(folder, 'le_customers.joblib'))

transactions.to_csv(os.path.join(folder, 'transaction_le.csv'), index= False)
customers.to_csv(os.path.join(folder, 'customers_le.csv'), index= False)
articles.to_csv(os.path.join(folder, 'articles_le.csv'), index= False)

# load smaller data

In [3]:
import os
import numpy as np 
import pandas as pd
from joblib import dump, load
from sklearn import preprocessing

In [4]:
folder = './h-and-m-personalized-fashion-recommendations/'
tr = pd.read_csv(os.path.join(folder, 'transaction_le.csv'))
cus = pd.read_csv(os.path.join(folder, 'customers_le.csv'))
art = pd.read_csv(os.path.join(folder, 'articles_le.csv'))

le_articles = load(os.path.join(folder, 'le_articles.joblib'))
le_customers = load(os.path.join(folder, 'le_customers.joblib'))

In [5]:
tr.head()

        t_dat  customer_id  article_id     price  sales_channel_id
0  2018-09-20            2       40179  0.050831                 2
1  2018-09-20            2       10520  0.030492                 2
2  2018-09-20            7        6387  0.015237                 2
3  2018-09-20            7       46304  0.016932                 2
4  2018-09-20            7       46305  0.016932                 2

In [6]:
tr['article_id'] = tr['article_id'].astype(np.int32)
tr['customer_id'] = tr['customer_id'].astype(np.int32)
tr['sales_channel_id'] = tr['sales_channel_id'].astype('int8')
tr['price'] = tr['price'].astype('float32')

In [7]:
tr['buy'] = 1

In [8]:
tr.head()

        t_dat  customer_id  article_id     price  sales_channel_id  buy
0  2018-09-20            2       40179  0.050831                 2    1
1  2018-09-20            2       10520  0.030492                 2    1
2  2018-09-20            7        6387  0.015237                 2    1
3  2018-09-20            7       46304  0.016932                 2    1
4  2018-09-20            7       46305  0.016932                 2    1

In [9]:
tr['t_dat'] = pd.to_datetime(tr['t_dat'], format="%Y-%m-%d")